Project/Toir/src/InformationRegisters/МножественныеЗначенияАтрибутов/МножественныеЗначенияАтрибутов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МножественныеЗначенияАтрибутов</name>
  <resources>
    <name>ДоступноеЗначение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуемоеЗначение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТабличныйАтрибут</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Класс</name>
    <type>
      <types>CatalogRef.ОбъектыНоменклатуры</types>
      <types>CatalogRef.Классы</types>
      <types>CatalogRef.НоменклатураКласса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АтрибутКласса</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АтрибутыКласса</types>
      <types>CatalogRef.НаборыАтрибутов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗначениеАтрибутаКласса</name>
    <type>
      <types>CatalogRef.ОбъектыНоменклатуры</types>
      <types>CatalogRef.ВариантыЗначенийАтрибутовКласса</types>
      <types>CatalogRef.Классы</types>
      <types>CatalogRef.НоменклатураКласса</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Catalogs/Классы/Классы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Классы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВидыТехОпераций</name>
      <description>Виды тех.операции</description>
    </items>
    <items>
      <name>ВложенныеТехКарты</name>
      <description>Вложенные тех карты</description>
    </items>
    <items>
      <name>КлассыТехКарт</name>
      <description>Классы тех. карт</description>
    </items>
    <items>
      <name>СтрокиТехОпераций</name>
      <description>Строки тех.операций</description>
    </items>
    <items>
      <name>ТехнологическиеКарты</name>
      <description>Технологические карты</description>
    </items>
    <items>
      <name>ТипыТехКарт</name>
      <description>Типы тех. карт</description>
    </items>
    <items>
      <name>Оборудование</name>
      <description>Оборудование</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьВИерархииТО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАтрибута</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураКласса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектыНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассТабличнаяЧасть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаКласса</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаКласса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияКласса</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаНоменклатуры</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияНоменклатуры</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаОбъекта</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияОбъекта</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикКлассов</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикНоменклатуры</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикОбъектовНоменклатуры</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоСчетчику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШагСчетчика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрисвоенНомерПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимКонтроляДублейПоНаименованию</name>
    <type>
      <types>EnumRef.РежимыКонтроляДублей</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольДублейВПределахКласса</name>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/InformationRegisters/МножественныеЗначенияАтрибутов/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ПрочитатьЗначенияТабличныхАтрибутов(СписокНоменклатуры, 
											  СписокКлассов = Неопределено, 
											  ДанныеТабличныхАтрибутов, 
											  НовыйИДСтроки = 1, 
											  СоответствиеИДСтрок = Неопределено, 
											  СтрокиТабличныхАтрибутов,
											  ЗначенияТабличныхАтрибутов) Экспорт
	
	// Чтение строк табличных атрибутов (строки-номенклатура классов).
	ТаблицаАтрибутов = Справочники.НоменклатураКласса.ПолучитьСтрокиТабличныхАтрибутов(
		СписокНоменклатуры, ДанныеТабличныхАтрибутов);
	ТаблицаАтрибутов.Колонки.Добавить("ИДСтроки");
	
	ПустаяНоменклатура = Справочники.НоменклатураКласса.ПустаяСсылка();
	
	// Строки-классы.
	СписокРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(СписокКлассов);
	ТаблицаАтрибутовКлассов = Справочники.Классы.ПолучитьСтрокиТабличныхАтрибутов(
		СписокРодителей, ДанныеТабличныхАтрибутов);
	Для Каждого СтрокаТЗ ИЗ ТаблицаАтрибутовКлассов Цикл
		СтрокаКласса = ТаблицаАтрибутов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКласса, СтрокаТЗ);
		СтрокаКласса.Объект = СтрокаТЗ.КлассДляЧтения;
		Если ЗначениеЗаполнено(СтрокаКласса.ЗначениеАтрибутаКласса) Тогда
			СтрокаКласса.ИсточникЗначений = СтрокаКласса.ЗначениеАтрибутаКласса;
			СтрокаКласса.ЗначениеАтрибутаКласса = ПустаяНоменклатура;
		КонецЕсли;
		Если СтрокаКласса.СтатусНаследования = 1 Тогда
			СтрокаКласса.СтатусНаследования = 3;
		КонецЕсли;
	КонецЦикла;
	
	СоответствиеИДСтрокВложенных = Новый Соответствие;
	НоменклатураВложенная        = Новый Массив;
	КлассыВложенные              = Новый Массив;
	
	ТипНоменклатура = Тип("СправочникСсылка.НоменклатураКласса");
	
	Для Каждого СтрокаТЗ ИЗ ТаблицаАтрибутов Цикл
		
		ЗначениеПоиска = ?(ЗначениеЗаполнено(СтрокаТЗ.ЗначениеАтрибутаКласса), 
			СтрокаТЗ.ЗначениеАтрибутаКласса, СтрокаТЗ.ИсточникЗначений);
			
		// СоответствиеИДСтрокВложенных - соответствие класса прочитанной строки и массива строк, добавленных в обработку.
		МассивСтрок = СоответствиеИДСтрокВложенных[ЗначениеПоиска];
		Если МассивСтрок = Неопределено Тогда
			МассивСтрок = Новый Массив;
			СоответствиеИДСтрокВложенных.Вставить(ЗначениеПоиска, МассивСтрок);
			// Использутся для чтения значений вложенных таб.частей.
			Если ТипЗнч(ЗначениеПоиска) = ТипНоменклатура Тогда
				НоменклатураВложенная.Добавить(ЗначениеПоиска);
			Иначе
				КлассыВложенные.Добавить(ЗначениеПоиска);
			КонецЕсли;
		КонецЕсли;
		
		// Соответствие родительских строк (из вызывающей процедуры при рекурсивном вызове).
		Если СоответствиеИДСтрок = Неопределено Тогда
			// Если родительских строк нет - значит ИД родительской строки = 0.
			МассивРодителей = Новый Массив;
			МассивРодителей.Добавить(Новый Структура("ИДСтроки, ЗначениеАтрибутаКласса, СтатусНаследования", 0, Неопределено, 1));
		Иначе
			МассивРодителей = СоответствиеИДСтрок[СтрокаТЗ.Объект];
			Если МассивРодителей = Неопределено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		// Добавляем строки таб.части с привязкой к родительским строкам.
		Для Каждого СтрокаРодитель ИЗ МассивРодителей Цикл
			СтрокаТЗ.ИДСтроки = НовыйИДСтроки;
			
			СтрокаТЧ = СтрокиТабличныхАтрибутов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаТЗ);
			
			СтрокаТЧ.ИДСтрокиРодителя   = СтрокаРодитель.ИДСтроки;
			Если СтрокаРодитель.ИДСтроки > 0 И НЕ ЗначениеЗаполнено(СтрокаРодитель.ЗначениеАтрибутаКласса) Тогда
				СтрокаТЧ.СтатусНаследования = Макс(СтрокаТЧ.СтатусНаследования, СтрокаРодитель.СтатусНаследования);
			КонецЕсли;
			МассивСтрок.Добавить(СтрокаТЧ);
			
			НовыйИДСтроки = НовыйИДСтроки + 1;
		КонецЦикла;
	КонецЦикла;
	
	// Чтение значений атрибутов строк (номенклатура классов).
	ЗначенияАтрибутов = Справочники.НоменклатураКласса.ПолучитьТаблицуАтрибутов(НоменклатураВложенная);
	ТипКолонки = Новый ОписаниеТипов(
		ЗначенияАтрибутов.Колонки.Объект.ТипЗначения, "СправочникСсылка.Классы");
	ЗначенияАтрибутов.Колонки.Объект.Имя = "ОбъектУдалить";
	ЗначенияАтрибутов.Колонки.Добавить("Объект", ТипКолонки);
	ЗначенияКолонки = ЗначенияАтрибутов.ВыгрузитьКолонку("ОбъектУдалить");
	ЗначенияАтрибутов.ЗагрузитьКолонку(ЗначенияКолонки, "Объект");
	// Строки-классы.
	СписокРодителей          = Справочники.Классы.ПолучитьТаблицуРодителей(КлассыВложенные);
	ЗначенияАтрибутовКлассов = Справочники.Классы.ПолучитьТаблицуАтрибутов(СписокРодителей);
	
	Для Каждого СтрокаТЗ ИЗ ЗначенияАтрибутовКлассов Цикл
		СтрокаЗначения = ЗначенияАтрибутов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗначения, СтрокаТЗ);
		СтрокаЗначения.Объект = СтрокаТЗ.КлассДляЧтения;
		Если НЕ ЗначениеЗаполнено(СтрокаТЗ.ТипЗначения) И ЗначениеЗаполнено(СтрокаТЗ.ТипЗначенияРеквизита) Тогда
			СтрокаЗначения.ТипЗначения = ЗначениеИзСтрокиВнутр(СтрокаТЗ.ТипЗначенияРеквизита);
		КонецЕсли;
	КонецЦикла;
	
	ДанныеТабличныхАтрибутовВложенных = Новый Массив;
	МассивОбъектовДляЧтения = Новый Массив;
	
	Для Каждого СтрокаЗначений ИЗ ЗначенияАтрибутов Цикл
		// Выписываем списочные атрибуты.
		Если СтрокаЗначений.МножественноеЗначение И СтрокаЗначений.КлассТабличнаяЧасть Тогда
			ДанныеТабличныхАтрибутовВложенных.Добавить(СтрокаЗначений.АтрибутКласса);
		КонецЕсли;
		
		МассивСтрок = СоответствиеИДСтрокВложенных[СтрокаЗначений.Объект];
		Если МассивСтрок = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаТаб ИЗ МассивСтрок Цикл
			СтрокаТЧ = ЗначенияТабличныхАтрибутов.Добавить();
			СтрокаТЧ.ИДСтрокиРодителя        = СтрокаТаб.ИДСтрокиРодителя;
			СтрокаТЧ.АтрибутКласса           = СтрокаТаб.АтрибутКласса;
			СтрокаТЧ.ИДСтроки                = СтрокаТаб.ИДСтроки;
			СтрокаТЧ.АтрибутТаблицы          = СтрокаЗначений.АтрибутКласса;
			СтрокаТЧ.ЗначениеАтрибутаТаблицы = СтрокаЗначений.ЗначениеАтрибутаКласса;
		КонецЦикла;
	КонецЦикла;
	
	Если ДанныеТабличныхАтрибутовВложенных.Количество() > 0 Тогда
		ПрочитатьЗначенияТабличныхАтрибутов(НоменклатураВложенная, 
											КлассыВложенные, 
											ДанныеТабличныхАтрибутовВложенных, 
											НовыйИДСтроки, 
											СоответствиеИДСтрокВложенных,
											СтрокиТабличныхАтрибутов,
											ЗначенияТабличныхАтрибутов);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий
//Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
//Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти
